app/Controllers/Transaction.php

    public function save()
    {
        $this->transactionModel->save([
            'id_user' => 1,
            'id_ticket' => $this->request->getVar('id_ticket'),
            'kode' => 'INV' . date('dmyhs'),
            'harga' => 80000,
        ]);
---
INSERT INTO `transaction` (`id_user`, `id_ticket`, `kode`, `harga`, `tgl`, `tgl_update`) VALUES (1, '6', 'INV2212220451', 80000, '2022-12-22 04:00:51', '2022-12-22 04:00:51')