app/Models/ComingModel.php

    public function getComing()
    {
        $builder = $this->db->table('ticket');
        $builder->join('local', 'ticket.id_local = local.id_local');
        $builder->join('genre', 'ticket.id_genre = genre.id_genre');
        $builder->join('artist', 'ticket.id_artist = artist.id_artist');
        $builder->orderBy("tgl", "asc");
        $query = $builder->get();
---
SELECT *
FROM `ticket`
JOIN `local` ON `ticket`.`id_local` = `local`.`id_local`
JOIN `genre` ON `ticket`.`id_genre` = `genre`.`id_genre`
JOIN `artist` ON `ticket`.`id_artist` = `artist`.`id_artist`
ORDER BY `tgl` ASC