app/Models/HomeModel.php

    public function getTicket($id_ticket = false)
    {
        if ($id_ticket == false) {
            $query = $this->db->table('ticket')->join('local', 'ticket.id_local = local.id_local')
                ->orderBy("jumlah_tiket", "desc")
                ->get();
            return $query;
        }
        return $this->join('artist', 'ticket.id_artist = artist.id_artist')
            ->join('local', 'ticket.id_local = local.id_local')
            ->join('genre', 'ticket.id_genre = genre.id_genre')
            ->where(['id_ticket' => $id_ticket])->first();
---
SELECT *
FROM `ticket`
JOIN `local` ON `ticket`.`id_local` = `local`.`id_local`
ORDER BY `jumlah_tiket` DESC
SELECT *
FROM `ticket`
JOIN `artist` ON `ticket`.`id_artist` = `artist`.`id_artist`
JOIN `local` ON `ticket`.`id_local` = `local`.`id_local`
JOIN `genre` ON `ticket`.`id_genre` = `genre`.`id_genre`
WHERE `id_ticket` = '4'
 LIMIT 1