app/Models/LocalModel.php

    public function getLocal()
    {
        return $this->findAll();
---
SELECT *
FROM `local`