app/Models/TransactionModel.php

    public function getTransaction($id_transaction = false)
    {
        if ($id_transaction == false) {
            $builder = $this->db->table('transaction');
            $builder->join('user', 'transaction.id_user = user.id_user');
            $builder->join('ticket', 'transaction.id_ticket = ticket.id_ticket');
            $builder->orderBy("transaction.tgl", "desc");
            $query = $builder->get();
---
SELECT *
FROM `transaction`
JOIN `user` ON `transaction`.`id_user` = `user`.`id_user`
JOIN `ticket` ON `transaction`.`id_ticket` = `ticket`.`id_ticket`
ORDER BY `transaction`.`tgl` DESC